
## :x: Apply Failed

[CI link](https://github.com/hawk0616/recruit-service-board-infla/actions/runs/6238513889)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=/aws/ecs/recruit-service-board]
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_ssm_parameter.rds_password: Reading...
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:113713103169:cluster/recruit-service-board]
aws_ecr_repository.ecr_repository: Refreshing state... [id=recruit-service-board]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06a74de91e584f523]
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=1077804475]
aws_iam_role.ecs_task: Refreshing state... [id=recruit-service-board-ecs-task]
aws_iam_role.ecs: Refreshing state... [id=recruit-service-board-ecs]
aws_iam_role_policy_attachment.ecs_basic: Refreshing state... [id=recruit-service-board-ecs-20230918174618982500000001]
data.aws_ssm_parameter.rds_password: Read complete after 0s [id=/recruit-service-board/rds/password]
aws_ecs_task_definition.ecs_task_definition: Refreshing state... [id=recruit-service-board]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=recruit-service-board]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-027284c710a0d8892]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0b4fa9cfb59fb8ed6]
aws_security_group.alb: Refreshing state... [id=sg-0ea3a71bbd61c86a8]
aws_subnet.rds_subnet: Refreshing state... [id=subnet-0b82a1db37327b596]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:targetgroup/recruit-service-board-tg/454711001d84759e]
aws_security_group.ecs: Refreshing state... [id=sg-01392c715b6f27337]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e0e6b1c0c1ac041b]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ef372ea55e63234b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-06b113e053f3b1456]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b66a8be9a7ddf00e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06d46b412cd4c9c97]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-045bc34d7c279cb27]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00f307d2ae25b4534]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c5a36c42816c6a6e]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09e72ede8507a7ede]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-09fbc8a2cc5227fc3]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-05212acebdfd26b46]
aws_security_group.rds: Refreshing state... [id=sg-01d224fac4c4d51f5]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1730019703]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:loadbalancer/app/recruit-service-board-alb/56d6da1d3ef15356]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-088311edf380f4573]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00f307d2ae25b45341080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07700ba4124e8d2ab]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-031bf5efc3f63faec]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0dd3ed9e6c5dcdb96]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-00ecc0f91b532aa39]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f95a65c3fedee2a9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c5a36c42816c6a6e1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09e72ede8507a7ede1080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener/app/recruit-service-board-alb/56d6da1d3ef15356/1eaa46f405a18931]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:113713103169:listener-rule/app/recruit-service-board-alb/56d6da1d3ef15356/1eaa46f405a18931/1426ab8034eecf22]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:113713103169:service/recruit-service-board/recruit-service-board]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.my_db_instance will be created
  + resource "aws_db_instance" "my_db_instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "mydb"
      + db_subnet_group_name                  = "recruit-service-board-db-subnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.mysql5.7"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Name" = "recruit-service-board RDS Instance"
        }
      + tags_all                              = {
          + "Name" = "recruit-service-board RDS Instance"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = [
          + "sg-01d224fac4c4d51f5",
        ]
    }

  # aws_db_subnet_group.my_db_subnet_group will be created
  + resource "aws_db_subnet_group" "my_db_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "recruit-service-board-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0b82a1db37327b596",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "recruit-service-board-db-subnet-group"
        }
      + tags_all                = {
          + "Name" = "recruit-service-board-db-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_db_subnet_group.my_db_subnet_group: Creating...
╷
│ Error: creating RDS DB Subnet Group (recruit-service-board-db-subnet-group): DBSubnetGroupDoesNotCoverEnoughAZs: The DB subnet group doesn't meet Availability Zone (AZ) coverage requirement. Current AZ coverage: ap-northeast-1d. Add subnets to cover at least 2 AZs.
│ 	status code: 400, request id: 8c2220f5-051d-4cf9-89d4-e115eb7a36d1
│ 
│   with aws_db_subnet_group.my_db_subnet_group,
│   on network.tf line 34, in resource "aws_db_subnet_group" "my_db_subnet_group":
│   34: resource "aws_db_subnet_group" "my_db_subnet_group" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":12,"Program":"tfcmt","SHA1":"d79d0f7f097bc0e98bd6b5d7ed45440ef0596fcc","Vars":{},"WorkflowName":"Terraform"} -->